start_message = """
سلام. به بات «برنامه‌های پیشنهادی فردا» روزنامه‌ی شریف خوش‌آمدید.
اگر برنامه‌ای در دانشگاه شریف برگزار می‌شود که دوست دارید در پست برنامه‌های پیشنهادی فردا در کانال روزنامه شریف درج شود، با استفاده از این بات می‌توانید زمان و مکان برگزاری آن‌را اعلام کنید.
برای افزدون برنامه، از دستور /add استفاده کنید.
"""

help_message = """
/add: افزودن رویداد جدید
/help: مشاهده‌ی راهنما
"""

admin_help_message = """
دستورات کاربران:
{}

دستورات ادمین (این بخش به کاربران عادی نمایش داده نمی‌شود)
/get: دریافت پیام برنامه‌های فردا
/getall: دریافت برنامه‌های پیشنهادی یکی از روزهای آینده
""".format(help_message)

add_message = """
هر کدام از اطلاعات زیر در مورد برنامه‌ی خود را با کلیک روی آن می‌توانید وارد کنید. توجه کنید که مشخص‌ کردن عنوان، تاریخ و زمان برگزاری برنامه ضروری‌ست.
"""

choices_message = {
    'Title': 'عنوان برنامه‌:',
    'Day': """
تاریخ برگزاری برنامه (روز را به صورت یک عدد فارسی بنویسید)
نمونه: ۲۹    
    """,
    'Date': 'تاریخ برنامه‌ی خود رو در تقویم زیر انتخاب کنید:',
    'Time': ':ساعت برنامه',
    'Invited': 'مدعو برنامه. اگر چند مدعو دارید، هر کدام را در یک خط بنویسید:',
    'Location': 'محل برگزاری برنامه (اگر برنامه به صورت حضوری برگزار می‌شود)',
    'Link': 'لینک حضور مجازی در برنامه. اگر چند لینک دارید، هر کدام را در یک خط بنویسید:',
    'Telegram Channel': 'کانال تلگرام برگزارکننده. اگر چند کانال دارید، هر کدام را در یک خط بنویسید:',
    'Calendar': 'لینک افزودن برنامه به تقویم گوگل',
    'Done': """
اطلاعات زیر در مورد برنامه‌ی شما دریافت شد:
{}
برای اضافه کردن برنامه‌ی جدید، از دستور /add استفاده کنید.
    """,
    'admin_Date': 'تاریخ مورد نظر خود را انتخاب کنید:'
}

received_info_message = """
دریافت شد. اطلاعاتی که تا کنون از برنامه‌ی خود داده‌اید:
{}
می‌توانید گزینه‌ی دیگری را انتخاب کنید و یا اطلاعات فعلی را اصلاح کنید و یا با کلیک روی گزینه‌ی «ثبت» برنامه‌ی خود را ثبت کنید.
"""


fa_choices_keyboard = [
    ['عنوان', 'مدعو'],
    ['ماه', 'روز', 'ساعت'],
    ['مکان (حضوری)', 'لینک برگزاری', 'کانال تلگرام'],
    ['ثبت', 'انصراف'],
]

choices_keyboard = [
    ['Title', 'Invited'],
    ['Date', 'Time', 'Calendar'],
    ['Location', 'Link', 'Telegram Channel'],
    ['Done', 'Cancel'],
]

choices_to_fa = {
    'Title': 'عنوان برنامه',
    'Invited': 'مدعو برنامه',
    'Date': 'تاریخ برنامه',
    'Time': 'ساعت',
    'Location': 'مکان (حضوری)',
    'Link': 'لینک برگزاری',
    'Telegram Channel': 'کانال تلگرام برگزار کننده',
    'Calendar': 'لینک تقویم گوگل',
    'Done': 'ثبت',
    'Cancel': 'انصراف',
}

event_emojis = {
    'Title': '🔸',
    'Invited': '👤',
    'Time': '🕑 ساعت ',
    'Location': '🏢',
    'Link': '🖥',
    'Telegram Channel': '🆔',
    'Calendar': 📆
}


months = [
    ['خرداد' ,'اردیبهشت' ,'فروردین', ],
    ['شهریور' ,'مرداد' ,'تیر'],
    ['آذر' ,'آبان' ,'مهر'],
    ['اسفند' ,'بهمن', 'دی',]
]

CALLBACK_ERROR = 'دریافت اطلاعات با خطا مواجه شد'

days = [
    'شنبه', 'یک‌‌شنبه', 'دوشنبه', 'سه‌شنبه', 'چهارشنبه', 'پنج‌شنبه', 'جمعه'
]

info = ['Title', 'Time', 'Invited', 'Link', 'Location', 'Telegram Channel', 'Calendar']

fill_mandatory_fields_message = """
برخی از مشخصات برنامه ضروری هستند. از اطلاعات ضروری، موارد زیر را تکمیل نکرده‌اید:
{}
"""

add_event_failed_message = 'اضافه کردن رویداد با خطایی مواجه شد. لطفا دوباره تلاش کنید. در صورت حل نشدن، مشکل را با ادمین در میان بگذارید.'

new_event_admin_message = 'برنامه‌ی جدیدی اضافه کرد {}'

new_event_failed_admin_message = """
اضافه کردن برنامه‌ی جدید {} با خطا مواجه شد
اطلاعات برنامه:
{}
"""

events_message = """
{}

{}

▫️برای ثبت اطلاعات برنامه‌ها به ربات تلگرامی @sharifdailybot سری بزنید.

@sharifdaily
"""

splitter_character = {
    'Title': f"\n{event_emojis['Title']}",
    'Time': f"\n{event_emojis['Time']}",
    'Invited': "، ",
    'Link': f"\n{event_emojis['Link']}",
    'Location': f"\n{event_emojis['Location']}",
    'Telegram Channel': " ",
    'Calendar': ""
}

no_event_registered_message = 'برنامه‌ای برای تاریخ انتخاب شده ثبت نشده‌است.'

suggestion_message_header = '☀️برنامه‌های پیشنهادی فردا، %A {} %B:'

future_suggestion_message_header = '☀️برنامه‌های پیشنهادی {}:'

you_are_not_admin_message = 'You don\'t have the right access'

cancel_message = "دریافت اطلاعت برنامه متوقف شد. با دستور /add می‌توانید رویداد جدیدی اضافه کنید."

TIME_PICKER_CALLBACK = 'TIME'
CALENDAR_CALLBACK = 'CALENDAR'