start_message = """
سلام. به بات «برنامه‌های پیشنهادی فردا» روزنامه‌ی شریف خوش‌آمدید.
اگر برنامه‌ای در دانشگاه شریف برگزار می‌شود که دوست دارید در پست برنامه‌های پیشنهادی فردا در کانال روزنامه شریف درج شود، با استفاده از این بات می‌توانید زمان و مکان برگزاری آن‌را اعلام کنید.
برای افزدون برنامه، از دستور /add استفاده کنید.
"""

add_message = """
هر کدام از اطلاعات زیر در مورد برنامه‌ی خود را با کلیک روی آن می‌توانید وارد کنید.
"""

choices_message = {
    'عنوان': 'عنوان برنامه‌',
    'ماه': """
تاریخ برگزاری برنامه (نام ماه را به فارسی بنویسید)
نمونه: خرداد
""",
    'روز': """
تاریخ برگزاری برنامه (روز را به صورت یک عدد بنویسید)
نمونه: ۲۹    
    """,
    'ساعت': """
ساعت برنامه
نمونه: ۱۷:۳۰
    """,
    'مدعو': 'مدعو برنامه',
    'مکان (حضوری)': 'محل برگزاری برنامه (اگر برنامه به صورت حضوری برگزار می‌شود)',
    'لینک برگزاری': 'لینک حضور مجازی در برنامه',
    'کانال تلگرام': 'کانال تلگرام برگزارکننده',
    'لینک تقویم گوگل': 'لینک برنامه در تقویم گوگل',
    'ثبت': """
اطلاعات زیر در مورد برنامه‌ی شما دریافت شد:
{}
برای اضافه کردن برنامه‌ی جدید، از دستور /add استفاده کنید.
    """
}

received_info_message = """
دریافت شد. اطلاعاتی که تا کنون از برنامه‌ی خود داده‌اید:
{}
می‌توانید گزینه‌ی دیگری را انتخاب کنید و یا اطلاعات فعلی را اصلاح کنید و یا با کلیک روی گزینه‌ی «ثبت» برنامه‌ی خود را ثبت کنید.
"""


choices_keyboard = [
    ['عنوان', 'مدعو'],
    ['ماه', 'روز', 'ساعت'],
    ['مکان (حضوری)', 'لینک برگزاری', 'کانال تلگرام'],
    ['ثبت', 'انصراف'],
]

choices = {
    'عنوان': 'Title',
    'مدعو': 'Invited',
    'ماه': 'Month',
    'روز': 'Day',
    'ساعت': 'Hour',
    'مکان (حضوری)': 'Location',
    'لینک برگزاری': 'Link',
    'کانال تلگرام': 'Telegram Channel',
    'ثبت': 'Done',
    'انصراف': 'Cancel',
}
# Title|Month|Day|Hour|Location|Link|Telegram Channel|Invited

new_event_admin_message = 'رویداد جدید وارد شد'