start_message = """
سلام. به بات «برنامه‌های پیشنهادی فردا» روزنامه‌ی شریف خوش‌آمدید.
اگر برنامه‌ای در دانشگاه شریف برگزار می‌شود که دوست دارید در پست برنامه‌های پیشنهادی فردا در کانال روزنامه شریف درج شود، با استفاده از این بات می‌توانید زمان و مکان برگزاری آن‌را اعلام کنید.
برای افزدون برنامه، از دستور /add استفاده کنید.
"""

add_message = """
هر کدام از اطلاعات زیر در مورد برنامه‌ی خود را با کلیک روی آن می‌توانید وارد کنید.
"""

choices_message = {
    'Title': 'عنوان برنامه‌',
    'Month': """
تاریخ برگزاری برنامه (نام ماه را به فارسی بنویسید)
نمونه: خرداد
""",
    'Day': """
تاریخ برگزاری برنامه (روز را به صورت یک عدد بنویسید)
نمونه: ۲۹    
    """,
    'Hour': """
ساعت برنامه
نمونه: ۱۷:۳۰
    """,
    'Invited': 'مدعو برنامه',
    'Location': 'محل برگزاری برنامه (اگر برنامه به صورت حضوری برگزار می‌شود)',
    'Link': 'لینک حضور مجازی در برنامه',
    'Telegram Channel': 'کانال تلگرام برگزارکننده',
    'Calendar': 'لینک برنامه در تقویم گوگل',
    'Done': """
اطلاعات زیر در مورد برنامه‌ی شما دریافت شد:
{}
برای اضافه کردن برنامه‌ی جدید، از دستور /add استفاده کنید.
    """
}

received_info_message = """
دریافت شد. اطلاعاتی که تا کنون از برنامه‌ی خود داده‌اید:
{}
می‌توانید گزینه‌ی دیگری را انتخاب کنید و یا اطلاعات فعلی را اصلاح کنید و یا با کلیک روی گزینه‌ی «ثبت» برنامه‌ی خود را ثبت کنید.
"""


choices_keyboard = [
    ['عنوان', 'مدعو'],
    ['ماه', 'روز', 'ساعت'],
    ['مکان (حضوری)', 'لینک برگزاری', 'کانال تلگرام'],
    ['ثبت'],
]
